#+BIBLIOGRAPHY: ~/texmf/bibtex/bib/Master plain
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00
#+COLUMNS: %40ITEM(Task) %17Effort(Estimated Effort){:} %CLOCKSUM
* Strat

** Miscellaneous

*** Planning
    CLOCK: [2010-04-23 Fri 20:45]--[2010-04-23 Fri 20:56] =>  0:11

** Literature Review

*** TODO [#B] Read \cite{Signorino2003}
    :PROPERTIES:
    :Effort:   1:00
    :END:
*** TODO [#C] Read \cite{BasSignorinoEtAl2008}
    :PROPERTIES:
    :Effort:   1:00
    :END: 

*** DONE Read ~Formula~ package documentation and examples
    CLOCK: [2010-04-23 Fri 22:19]--[2010-04-23 Fri 22:58] =>  0:39
    :PROPERTIES:
    :Effort:   1:00
    :END:

See [[file:notes/Notes.org::*Formula%20R%20package][Notes]]

*** TODO [#A] Read ~maxLik~ package documentation and examples
    :PROPERTIES:
    :Effort:   1:00
    :END:

*** TODO Read ~mlogit~ package documentation and examples
    :PROPERTIES:
    :Effort:   1:00
    :END:
*** DONE Look at Strat matlab software
    :PROPERTIES:
    :Effort:   0:40
    :END: 

**** Install
     CLOCK: [2010-04-23 Fri 21:01]--[2010-04-23 Fri 21:10] =>  0:09
     :PROPERTIES:
     :Effort:   0:10
     :END: 

**** Read See \cite{Signorino2003a}
     CLOCK: [2010-04-23 Fri 21:10]--[2010-04-23 Fri 22:16] =>  1:06
     :PROPERTIES:
     :Effort:   0:30
     :END:

Read manual, took detailed notes, estimated the example, got
distracted on tree traversal methods.

**** What its features?
     :PROPERTIES:
     :Effort:   0
     :END:
**** How utilities and variables specified?
     :PROPERTIES:
     :Effort:   0
     :END:


** Features

*** TODO Write formula parser
    :PROPERTIES:
    :Effort:   0:10
    :END: 

Put coefficients into a *player* \times *outcome* \times *term* array

The array will include the union of all terms specified in the model. 
Constraints will be handled separately and passed to maxLik.


* Overview
#+BEGIN: columnview :hlines 1 :id global
| Task                                                       | Estimated Effort | CLOCKSUM |
|------------------------------------------------------------+------------------+----------|
| * Strat                                                    |             5:50 |     2:05 |
| ** Miscellaneous                                           |                  |     0:11 |
| *** Planning                                               |                  |     0:11 |
| ** Literature Review                                       |             5:40 |     1:54 |
| *** TODO [#A] Read \cite{Signorino2003}                    |             1:00 |          |
| *** TODO Read \cite{BasSignorinoEtAl2008}                  |             1:00 |          |
| *** DONE Read ~Formula~ package documentation and examples |             1:00 |     0:39 |
| *** TODO Read ~maxLik~ package documentation and examples  |             1:00 |          |
| *** TODO Read ~mlogit~ package documentation and examples  |             1:00 |          |
| *** DONE Look at Strat matlab software                     |             0:40 |     1:15 |
| **** Install                                               |             0:10 |     0:09 |
| **** Read See \cite{Signorino2003a}                        |             0:30 |     1:06 |
| **** What its features?                                    |                0 |          |
| **** How utilities and variables specified?                |                0 |          |
| ** Features                                                |             0:10 |          |
| *** TODO Write formula parser                              |             0:10 |          |
|------------------------------------------------------------+------------------+----------|
| * Overview                                                 |                  |          |
#+END:
